FunkyPancake/KeCalibrator/GeneratedCode/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTD1 (number 1), BRYMEN_RX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_BRYMEN_RX_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BRYMEN_RX_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BRYMEN_RX_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTD0 (number 2), BRYMEN_TX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_BRYMEN_TX_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BRYMEN_TX_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BRYMEN_TX_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTE8 (number 17), LED1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED1_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED1_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED1_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED1_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED1_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTB5 (number 18), LED2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED2_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED2_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED2_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED2_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED2_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTE11 (number 3), LED3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED3_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED3_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED3_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED3_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED3_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTE10 (number 4), LED4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED4_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED4_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED4_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED4_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED4_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC0 (number 26), MUX_A
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MUX_A_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_MUX_A_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_MUX_A_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_MUX_A_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MUX_A_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC17 (number 27), MUX_B
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MUX_B_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_MUX_B_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_MUX_B_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_MUX_B_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MUX_B_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTC16 (number 28), MUX_C
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MUX_C_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_MUX_C_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_MUX_C_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_MUX_C_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MUX_C_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTC15 (number 29), LED_IP
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_IP_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_IP_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED_IP_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED_IP_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_IP_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTC2 (number 21), BRD_DETEC
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BRD_DETEC_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BRD_DETEC_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_BRD_DETEC_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BRD_DETEC_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BRD_DETEC_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTC3 (number 20), LED_DONE
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_DONE_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_DONE_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_LED_DONE_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED_DONE_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_DONE_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
